tap "chanzuckerberg/tap"
tap "codecrafters-io/tap"
tap "hashicorp/tap"
tap "jondot/tap"
tap "ngrok/ngrok"
tap "warrensbox/tap"
brew "ack"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "asdf"
brew "autoenv"
brew "automake"
brew "openssl@3"
brew "readline"
brew "python@3.13"
brew "awscli"
brew "libssh2"
brew "bat"
brew "bison"
brew "glib"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docker-compose"
brew "docutils"
brew "dos2unix"
brew "eza"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "grep"
brew "haskell-stack"
brew "helix"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libffi"
brew "libtool"
brew "libyaml"
brew "mysql@5.7"
brew "ncdu"
brew "node-build"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "prettyping"
brew "python@3.11"
brew "ripgrep"
brew "ripgrep-all"
brew "rlwrap"
brew "ruby"
brew "ruby-install"
brew "seqkit"
brew "starship"
brew "tcl-tk"
brew "virtualenvwrapper"
brew "wget"
brew "yarn"
brew "zoxide"
brew "chanzuckerberg/tap/argus"
brew "chanzuckerberg/tap/aws-oidc"
brew "chanzuckerberg/tap/blessclient@1"
brew "chanzuckerberg/tap/fogg"
brew "chanzuckerberg/tap/happy"
brew "codecrafters-io/tap/codecrafters"
brew "jondot/tap/hygen"
cask "1password"
cask "aerial"
cask "alfred"
cask "chatgpt"
cask "chromium"
cask "discord"
cask "disk-drill"
cask "docker"
cask "firefox"
cask "font-hack"
cask "font-sauce-code-pro-nerd-font"
cask "google-drive"
cask "graphiql"
cask "istat-menus"
cask "iterm2"
cask "kitty"
cask "launchcontrol"
cask "livetail"
cask "logi-options+"
cask "macfuse"
cask "miniconda"
cask "ngrok"
cask "obsidian"
cask "openlens"
cask "orion"
cask "protonvpn"
cask "rectangle"
cask "sequel-ace"
cask "session-manager-plugin"
cask "signal"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xquartz"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "docker.docker"
vscode "donjayamanne.vscode-default-python-kernel"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "emericwarnez.hygen-vscode"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "henoc.svgeditor"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "jondot.vscode-hygen"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mattpocock.ts-error-translator"
vscode "maximus136.change-string-case"
vscode "mechatroner.rainbow-csv"
vscode "meta.relay"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "noku.rails-run-spec-vscode"
vscode "orta.vscode-jest"
vscode "ow.vscode-subword-navigation"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ria.elastic"
vscode "richie5um2.vscode-sort-json"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zengxingxin.sort-js-object-keys"
vscode "ziyasal.vscode-open-in-github"
