tap "chanzuckerberg/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jondot/tap"
brew "ack"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "python@3.11"
brew "awscli"
brew "bash-completion"
brew "libssh2"
brew "bat"
brew "bison"
brew "glib"
brew "cairo"
brew "chamber"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "docker-compose"
brew "docutils"
brew "dos2unix"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "go"
brew "gobject-introspection"
brew "libtool"
brew "guile"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "jq"
brew "libffi"
brew "libyaml"
brew "mysql"
brew "mysql@5.7"
brew "ncdu"
brew "neovim"
brew "node"
brew "node-build"
brew "nodenv"
brew "prettyping"
brew "python@3.10"
brew "python@3.9"
brew "qt"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "ruby-install"
brew "starship"
brew "the_silver_searcher"
brew "virtualenv"
brew "wget"
brew "yarn"
brew "chanzuckerberg/tap/aws-oidc"
brew "chanzuckerberg/tap/blessclient@1"
brew "chanzuckerberg/tap/happy"
brew "jondot/tap/hygen"
cask "1password"
cask "aerial"
cask "alfred"
cask "altair-graphql-client"
cask "anaconda"
cask "chromium"
cask "discord"
cask "docker"
cask "firefox"
cask "font-hack"
cask "font-sauce-code-pro-nerd-font"
cask "google-drive"
cask "graphiql"
cask "istat-menus"
cask "iterm2"
cask "launchcontrol"
cask "livetail"
cask "macfuse"
cask "obsidian"
cask "orion"
cask "protonvpn"
cask "rectangle"
cask "sequel-ace"
cask "session-manager-plugin"
cask "slack"
cask "steam"
cask "tresorit"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "emericwarnez.hygen-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.heygithub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "henoc.svgeditor"
vscode "humao.rest-client"
vscode "karunamurti.rspec-snippets"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "koichisasada.vscode-rdbg"
vscode "meta.relay"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mtxr.sqltools"
vscode "noku.rails-run-spec-vscode"
vscode "orta.vscode-jest"
vscode "pnp.polacode"
vscode "ria.elastic"
vscode "richie5um2.vscode-sort-json"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tyriar.sort-lines"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wmaurer.change-case"
vscode "ziyasal.vscode-open-in-github"
